In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\om\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\om\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\om\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\om\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\om\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\om\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [4]:
 df=pd.read_csv("Downloads/edtech_student_learning_data.csv")

In [5]:
#1
df.groupby("course")["attendance_pct"].mean()

course
AI & ML           72.983095
Data Analytics    73.146713
Data Science      73.632578
Generative AI     74.035648
Name: attendance_pct, dtype: float64

In [6]:
#2
df.groupby("city")["student_id"].count()

city
Bangalore     82
Chennai       73
Delhi         68
Hyderabad    100
Mumbai        95
Pune          87
Name: student_id, dtype: int64

In [8]:
#3
df.groupby("batch_type")["avg_quiz_score"].mean()

batch_type
Weekday    69.628099
Weekend    69.577947
Name: avg_quiz_score, dtype: float64

In [7]:
#4
df.groupby("placement_status")["avg_quiz_score"].mean()

placement_status
Not Placed    67.662722
Placed        70.577381
Name: avg_quiz_score, dtype: float64

In [8]:
#5
df.groupby(["course","city"])["student_id"].count()

course          city
AI & ML         Bangalore    21
                Chennai      14
                Delhi        16
                Hyderabad    19
                Mumbai       30
                Pune         26
Data Analytics  Bangalore    25
                Chennai      18
                Delhi        21
                Hyderabad    33
                Mumbai       26
                Pune         20
Data Science    Bangalore    19
                Chennai      24
                Delhi        12
                Hyderabad    31
                Mumbai       20
                Pune         22
Generative AI   Bangalore    17
                Chennai      17
                Delhi        19
                Hyderabad    17
                Mumbai       19
                Pune         19
Name: student_id, dtype: int64

In [9]:
#6
df.groupby("course")["project_score"].agg(["max","min","mean"])

                max  min       mean
course
AI & ML          99   50  74.158730
Data Analytics   99   50  75.839161
Data Science     99   50  75.992188
Generative AI    98   50  75.037037

In [10]:
#7
df.groupby("city")["learning_hours"].agg(["sum","mean"])

            sum       mean
city
Bangalore  1870  22.804878
Chennai    1557  21.328767
Delhi      1506  22.147059
Hyderabad  2206  22.060000
Mumbai     2150  22.631579
Pune       1886  21.678161

In [11]:
#8
df.groupby(["course","placement_status"])["student_id"].count()

course          placement_status
AI & ML         Not Placed          48
                Placed              78
Data Analytics  Not Placed          44
                Placed              99
Data Science    Not Placed          40
                Placed              88
Generative AI   Not Placed          37
                Placed              71
Name: student_id, dtype: int64

In [19]:
#9
result=df.groupby("course")["attendance_pct"].mean()
result[result>80]

Series([], Name: attendance_pct, dtype: float64)

In [20]:
#10
result=df.groupby("city")["student_id"].count()
result[result>50]

city
Bangalore     82
Chennai       73
Delhi         68
Hyderabad    100
Mumbai        95
Pune          87
Name: student_id, dtype: int64

In [28]:
#11
df.groupby("course")[["avg_quiz_score","assignment_score","project_score"]].agg(["mean"])

               avg_quiz_score assignment_score project_score
                         mean             mean          mean
course
AI & ML             69.023810        71.642857     74.158730
Data Analytics      69.041958        71.545455     75.839161
Data Science        69.960938        72.656250     75.992188
Generative AI       70.592593        72.166667     75.037037

In [10]:
#12
df["total_score"]=df["avg_quiz_score"]+df["project_score"]
result=df.groupby("course").agg(
    average_attendance=("attendance_pct","mean"),
    max_project_score=("project_score","max"),
    mean_total_score=("total_score","mean"))
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,total_score
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0,125
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN,140
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.6,8,Placed,5,60.83,501904.0,122
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,91,81,2.7,5,Not Placed,8,59.17,NaN,145
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0,91

In [15]:
#13
calculate= df.groupby("city").agg(
    total_students=("student_id", "count"),
    placed_students=("placement_status", "sum"),
    average_salary=("salary_offered", "mean"))
calculate.head()

,total_students,placed_students,average_salary
city,,,
Bangalore,82,Not PlacedPlacedPlacedNot PlacedPlacedNot Plac...,805241.500000
Chennai,73,PlacedNot PlacedPlacedNot PlacedPlacedNot Plac...,823148.090909
Delhi,68,Not PlacedNot PlacedPlacedPlacedPlacedNot Plac...,759655.918919
Hyderabad,100,PlacedNot PlacedNot PlacedPlacedNot PlacedPlac...,703994.405797
Mumbai,95,PlacedPlacedPlacedPlacedPlacedNot PlacedNot Pl...,767943.218750

In [16]:
df["enrollment_date"] = pd.to_datetime(df["enrollment_date"])

In [17]:
#14
df["year"] =df["enrollment_date"].dt.year
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,year,month,month_name,day_name,quarter
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,6,Placed,7,90.00,738963.0,2024,11,November,Monday,4
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,33,Not Placed,8,91.67,NaN,2024,9,September,Sunday,3
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,8,Placed,5,60.83,501904.0,2024,12,December,Thursday,4
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,5,Not Placed,8,59.17,NaN,2024,3,March,Saturday,1
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,23,Placed,9,84.17,970105.0,2024,2,February,Saturday,1

In [18]:
#15
df["month"] = df["enrollment_date"].dt.month
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,year,month,month_name,day_name,quarter
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,6,Placed,7,90.00,738963.0,2024,11,November,Monday,4
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,33,Not Placed,8,91.67,NaN,2024,9,September,Sunday,3
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,8,Placed,5,60.83,501904.0,2024,12,December,Thursday,4
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,5,Not Placed,8,59.17,NaN,2024,3,March,Saturday,1
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,23,Placed,9,84.17,970105.0,2024,2,February,Saturday,1

In [19]:
#16
df["MonthName"] = df["enrollment_date"].dt.month_name()
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,placement_status,feedback_score,attendance_pct,salary_offered,year,month,month_name,day_name,quarter,MonthName
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,Placed,7,90.00,738963.0,2024,11,November,Monday,4,November
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,Not Placed,8,91.67,NaN,2024,9,September,Sunday,3,September
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,Placed,5,60.83,501904.0,2024,12,December,Thursday,4,December
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,Not Placed,8,59.17,NaN,2024,3,March,Saturday,1,March
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,Placed,9,84.17,970105.0,2024,2,February,Saturday,1,February

In [20]:
#17
df["DayName"] = df["enrollment_date"].dt.day_name()
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,feedback_score,attendance_pct,salary_offered,year,month,month_name,day_name,quarter,MonthName,DayName
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,7,90.00,738963.0,2024,11,November,Monday,4,November,Monday
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,8,91.67,NaN,2024,9,September,Sunday,3,September,Sunday
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,5,60.83,501904.0,2024,12,December,Thursday,4,December,Thursday
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,8,59.17,NaN,2024,3,March,Saturday,1,March,Saturday
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,9,84.17,970105.0,2024,2,February,Saturday,1,February,Saturday

In [21]:
#18
df["Quarter"] = df["enrollment_date"].dt.quarter
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,attendance_pct,salary_offered,year,month,month_name,day_name,quarter,MonthName,DayName,Quarter
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,90.00,738963.0,2024,11,November,Monday,4,November,Monday,4
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,91.67,NaN,2024,9,September,Sunday,3,September,Sunday,3
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,60.83,501904.0,2024,12,December,Thursday,4,December,Thursday,4
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,59.17,NaN,2024,3,March,Saturday,1,March,Saturday,1
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,84.17,970105.0,2024,2,February,Saturday,1,February,Saturday,1

In [22]:
#19
df.groupby("year")["student_id"].count()

year
2024    505
Name: student_id, dtype: int64

In [23]:
#20
df.groupby("MonthName")["attendance_pct"].count()

MonthName
April        49
August       42
December     37
February     37
January      50
July         30
June         41
March        40
May          45
November     49
October      52
September    33
Name: attendance_pct, dtype: int64

In [24]:
#21
df["total_score"] = df["avg_quiz_score"] + df["project_score"]
df.groupby("Quarter")["total_score"].mean()

Quarter
1    143.157480
2    145.074074
3    146.019048
4    145.442029
Name: total_score, dtype: float64

In [25]:
#22
df.groupby("DayName")["student_id"].count()

DayName
Friday       74
Monday       79
Saturday     86
Sunday       74
Thursday     78
Tuesday      61
Wednesday    53
Name: student_id, dtype: int64

In [26]:
#23
df["month"] = df["enrollment_date"].dt.month
df["month"].value_counts().head(1)

month
10    52
Name: count, dtype: int64

In [28]:
#24
#df["Quarter"] = df["project_score"].dt.quarter
#df.groupby("Quarter")["project_score"].mean()

In [29]:
#25
df.groupby(["year","course"])["avg_quiz_score"].mean()

year  course
2024  AI & ML           69.023810
      Data Analytics    69.041958
      Data Science      69.960938
      Generative AI     70.592593
Name: avg_quiz_score, dtype: float64

In [30]:
#26
df.groupby(["MonthName","placement_status"])["student_id"].mean()

MonthName  placement_status
April      Not Placed          1228.533333
           Placed              1246.382353
August     Not Placed          1198.187500
           Placed              1237.884615
December   Not Placed          1190.687500
           Placed              1297.809524
February   Not Placed          1154.000000
           Placed              1252.111111
January    Not Placed          1182.210526
           Placed              1235.774194
July       Not Placed          1190.800000
           Placed              1264.500000
June       Not Placed          1270.428571
           Placed              1312.259259
March      Not Placed          1241.000000
           Placed              1271.629630
May        Not Placed          1271.769231
           Placed              1248.156250
November   Not Placed          1277.277778
           Placed              1239.516129
October    Not Placed          1298.764706
           Placed              1271.942857
September  Not Placed          1233.625000
           Placed              1277.640000
Name: student_id, dtype: float64

In [31]:
#27
df.groupby(["city","year"])["placement_status"].count()

city       year
Bangalore  2024     82
Chennai    2024     73
Delhi      2024     68
Hyderabad  2024    100
Mumbai     2024     95
Pune       2024     87
Name: placement_status, dtype: int64

In [32]:
#28
year_count=df.groupby("year")["student_id"].count()
year_count[year_count>100]

year
2024    505
Name: student_id, dtype: int64

In [33]:
#29
course=df.groupby("course")["total_score"].mean()
course[course>220]

Series([], Name: total_score, dtype: float64)

In [34]:
#30
df.groupby("Quarter")["attendance_pct"].mean()

Quarter
1    72.434252
2    72.629704
3    72.857238
4    75.525362
Name: attendance_pct, dtype: float64

In [35]:
#31
df.groupby("course")["salary_offered"].mean()

course
AI & ML           785484.230769
Data Analytics    788028.545455
Data Science      781899.318182
Generative AI     713728.661972
Name: salary_offered, dtype: float64

In [36]:
#32
df.groupby("city")["salary_offered"].mean()

city
Bangalore    805241.500000
Chennai      823148.090909
Delhi        759655.918919
Hyderabad    703994.405797
Mumbai       767943.218750
Pune         779828.883333
Name: salary_offered, dtype: float64

In [37]:
#33
df.groupby("city")["salary_offered"].mean().sort_values(ascending=False)
df.head(3)

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,salary_offered,year,month,month_name,day_name,quarter,MonthName,DayName,Quarter,total_score
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,738963.0,2024,11,November,Monday,4,November,Monday,4,125
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,NaN,2024,9,September,Sunday,3,September,Sunday,3,140
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,501904.0,2024,12,December,Thursday,4,December,Thursday,4,122

In [38]:
#34
(df["placement_status"]=="Placed").groupby(df["course"]).mean().sort_values(ascending=False).head(1)

course
Data Analytics    0.692308
Name: placement_status, dtype: float64

In [39]:
#35
df.groupby(["batch_type","Quarter"])["attendance_pct"].mean().sort_values(ascending=False).head()

batch_type  Quarter
Weekend     4          77.100548
Weekday     3          74.947917
            4          73.756308
Weekend     2          73.628462
            1          73.149412
Name: attendance_pct, dtype: float64

In [40]:
#36
df.groupby(["MonthName","course"])["student_id"].count()

MonthName  course
April      AI & ML            7
           Data Analytics    17
           Data Science      13
           Generative AI     12
August     AI & ML           12
           Data Analytics    15
           Data Science       6
           Generative AI      9
December   AI & ML            9
           Data Analytics    11
           Data Science      11
           Generative AI      6
February   AI & ML           10
           Data Analytics    10
           Data Science      11
           Generative AI      6
January    AI & ML           14
           Data Analytics    15
           Data Science      11
           Generative AI     10
July       AI & ML           10
           Data Analytics     5
           Data Science       8
           Generative AI      7
June       AI & ML            8
           Data Analytics    13
           Data Science      13
           Generative AI      7
March      AI & ML           13
           Data Analytics    11
           Data Science       5
           Generative AI     11
May        AI & ML            8
           Data Analytics    12
           Data Science      15
           Generative AI     10
November   AI & ML           15
           Data Analytics    10
           Data Science      11
           Generative AI     13
October    AI & ML           14
           Data Analytics    11
           Data Science      17
           Generative AI     10
September  AI & ML            6
           Data Analytics    13
           Data Science       7
           Generative AI      7
Name: student_id, dtype: int64

In [41]:
#37
df.groupby("DayName")["student_id"].count()

DayName
Friday       74
Monday       79
Saturday     86
Sunday       74
Thursday     78
Tuesday      61
Wednesday    53
Name: student_id, dtype: int64

In [42]:
#38
df.groupby(["Quarter","placement_status"])["student_id"].count()

Quarter  placement_status
1        Not Placed          42
         Placed              85
2        Not Placed          42
         Placed              93
3        Not Placed          34
         Placed              71
4        Not Placed          51
         Placed              87
Name: student_id, dtype: int64